//===========================================================================================================================================================
// 
// プレイヤーの車 [car_player.cpp]
// Author : souma umeda
// 
//===========================================================================================================================================================
#include "car_player.h"
#include "manager.h"
#include "fade.h"
#include "gauge.h"
#include "speedmeter.h"

//========================================================================================================================
// コンストラクタ
//========================================================================================================================
CCarPlayer::CCarPlayer() :
m_pGauge(nullptr)
,m_pGearNum(0)
{

}

//========================================================================================================================
// デストラクタ
//========================================================================================================================
CCarPlayer::~CCarPlayer()
{
}

//========================================================================================================================
// 初期設定
//========================================================================================================================
HRESULT CCarPlayer::Init()
{
	CCamera* pCamera = CManager::GetCamera();
	if(pCamera!=nullptr)
	{
		pCamera->SetCameraTarget(CCamera::PLAYER);
	}

	SetType(TYPE::CAR_PLAYER);
	SetSize({ 10.0f,10.0f,30.0f });
	SetPos({ -250.0f,0.0f,0.0f });

	// ガソリンゲージの生成
	m_pGauge = CGauge::Create();

	// ギアの数字
	m_pGearNum = CDisplayNumber::Create(
		{ GEARNUM_POS_X,GEARNUM_POS_Y,0 },	// 位置
		0,									// 数値
		CDisplayNumber::DIGID::DIGID_ONE,	// 桁数
		CNumber::FONT_DOT_WBW);				// フォント

	CSpeedMeter::Create();

	CCar::Init();

	return S_OK;
}

//========================================================================================================================
// 終了処理
//========================================================================================================================
void CCarPlayer::Uninit()
{
	m_pGauge->Uninit();
	m_pGearNum->Uninit();

	CCar::Uninit();
}

//========================================================================================================================
// 更新処理
//========================================================================================================================
void CCarPlayer::Update()
{
	CCamera* pCamera = CManager::GetCamera();
	D3DXVECTOR3 move = GetMove();
	
	if (pCamera != nullptr)
	{
		D3DXVECTOR3 rot = GetRot();
		D3DXVECTOR3 camerarot = pCamera->GetRot();

		pCamera->SetRot({ camerarot.x,rot.y,camerarot.z });
	}

	// シーンが止まっていたら
	if (CManager::GetScenestop())
		return;

	move.y -= 3.0f;	// 重力加算
	SetMove(move);

	// ゲージの更新
	UpdateGauge();

	// ギアの数の更新
	UpdateGearNum();

	CCar::Update();
	
	if (GetPos().y < -250.0f)
	{
		// リスポーン処理
		ActionRespawn();
	}

	// ここで後で殺しておく
	if(m_pGauge->GetCurrValue() <= 0)
	{// ガソリンが切れたら
		ActionDown();
		CFade* pFade = CManager::GetFade();
		pFade->SetFade(CScene::MODE::MODE_RESULT, 60);
	}
}

//========================================================================================================================
// 描画処理
//========================================================================================================================
void CCarPlayer::Draw()
{
	CCar::Draw();
}

//===========================================================================================================
// 車変更処理
//===========================================================================================================
void CCarPlayer::ChangeCar(CParamStorage::TYPE hittype)
{
	InitType(hittype);
}

//========================================================================================================================
// 生成処理
//========================================================================================================================
CCarPlayer* CCarPlayer::Create(CParamStorage::TYPE cartype)
{
	CCarPlayer* pCarPlayer = new CCarPlayer;

	pCarPlayer->InitType(cartype);

	pCarPlayer->Init();

	return pCarPlayer;
}

//===========================================================================================================
// ゲージのアップデート
//===========================================================================================================
void CCarPlayer::UpdateGauge()
{
	// ゲージが存在していたら
	if (m_pGauge == nullptr)
	{	return;	}

	// ゲージの現在の値
	float Curr = m_pGauge->GetCurrValue();

	// スピード取得
	float Speed = GetAccumulationSpeed();

	// 走っていなかったら減らさない
	if (Speed <= 0)
	{	return; }
	Speed *= 0.1f;

	// ゲージをスピード分減らす
	m_pGauge->SetCurrValue(Curr - Speed);
}

//===========================================================================================================
// ゲージの回復処理
//===========================================================================================================
void CCarPlayer::SetRecoveryGauge(int n)
{
	float Curr = m_pGauge->GetCurrValue();

	if (Curr+n >= m_pGauge->GetMaxValue())
	{// 最大値を超えたら
		m_pGauge->SetCurrValue(m_pGauge->GetMaxValue());	// 最大値に設定する
		return;
	}

	m_pGauge->SetCurrValue(Curr + n);
}

//===========================================================================================================
// ギア数の更新
//===========================================================================================================
void CCarPlayer::UpdateGearNum()
{
	if (!m_pGearNum)
		return;
	m_pGearNum->Update(GetGear());
}
