//===========================================================================================================================================================
// 
// スピードメーターの針 [meterneedle.cpp]
// Author : souma umeda
// 
//===========================================================================================================================================================
#include "meterneedle.h"
#include "manager.h"
#include "search.h"
#include "car_player.h"

//========================================================================================================================
// コンストラクタ
//========================================================================================================================
CMeterNeedle::CMeterNeedle(int Prio,int nOrigin) :CObject2D(Prio, nOrigin)
{
}

//========================================================================================================================
// デストラクタ
//========================================================================================================================
CMeterNeedle::~CMeterNeedle()
{
}

//========================================================================================================================
// 初期設定
//========================================================================================================================
HRESULT CMeterNeedle::Init()
{
	int Idx = 0;
	Idx = CManager::GetTexture()->Regist("data\\TEXTURE\\needle_002.png");
	BindTexture(CManager::GetTexture()->GetAddress(Idx));
	
	SetSize({ 30.0f,70.0f,0.0f });

	CObject2D::Init();


	return S_OK;
}

//========================================================================================================================
// 終了処理
//========================================================================================================================
void CMeterNeedle::Uninit()
{
	CObject2D::Uninit();
}

//========================================================================================================================
// 更新処理
//========================================================================================================================
void CMeterNeedle::Update()
{
	CCarPlayer* pCarP = nullptr;
	pCarP = CSearch::SearchObject(pCarP, CObject::CAR_PLAYER);

	int Gear = pCarP->GetGear();

	// 必要な変数を用意
	float SpeedMax = pCarP->GetfMaxSpeed(Gear);	//  現在のギアの最大スピード
	float SpeedNow = pCarP->GetAccumulationSpeed();	// 現在のスピード

	float DiffNow = SpeedMax - SpeedNow;	// スピードの差を求める

	float range = (D3DX_PI + (D3DX_PI * 0.5f)) - (D3DX_PI * 0.5f);	// 範囲を設定

	float max = D3DX_PI;	// メーターの最大値を設定する
	float min = D3DX_PI * 0.5f;	// メーターの最小値を設定する

	float Ratio = SpeedNow / SpeedMax;	// 現在のスピードと最大スピードの割合を求める

	float Result = (-Ratio * max) + min;		// 割合

	if (/*Result > max + min*/Ratio >= 1)
	{ Result = max + min; }

	D3DXVECTOR3 rot = { 0.0f,0.0f,0.0f };
	rot.z = Result;
	SetRot(rot);

	CObject2D::Update();
}

//========================================================================================================================
// 描画処理
//========================================================================================================================
void CMeterNeedle::Draw()
{
	CObject2D::Draw();
}

//========================================================================================================================
// 生成処理
//========================================================================================================================
CMeterNeedle* CMeterNeedle::Create(D3DXVECTOR3 Parepos)
{
	CMeterNeedle* pNeedle = new CMeterNeedle;
	pNeedle->SetPos(Parepos);

	pNeedle->Init();

	return pNeedle;
}