//===========================================================================================================================================================
// 
// プレイヤーの管理クラス [player_manager.cpp]
// Author : souma umeda
// 
//===========================================================================================================================================================
#include "player_manager.h"
#include "search.h"
#include "camera.h"
#include "manager.h"

CCarPlayer* CPlayerManager::m_pCar = nullptr;
//===========================================================================================================
// コンストラクタ
//===========================================================================================================
CPlayerManager::CPlayerManager() :
	//m_pCar(nullptr)
	m_pController(nullptr)
{
}

//===========================================================================================================
// デストラクタ
//===========================================================================================================
CPlayerManager::~CPlayerManager()
{
}

//===========================================================================================================
// 初期設定
//===========================================================================================================
void CPlayerManager::Init()
{
	if (m_pCar == nullptr)
	{
		// 車を作成
		m_pCar = CCarPlayer::Create(CParamStorage::CAR_SPORTS);
	}

	if (m_pController = nullptr)
	{
		m_pController = new CPlayerController;
	}

}

//===========================================================================================================
// 終了処理
//===========================================================================================================
void CPlayerManager::Uninit()
{
	m_pCar->Uninit();
	m_pCar = nullptr;

	// プレイヤーコントローラーの削除
	delete m_pController;
	m_pController = nullptr;
}

//===========================================================================================================
// 更新処理
//===========================================================================================================
void CPlayerManager::Update()
{
	if (m_pCar != nullptr)
	{
		CCamera* pCamera = CManager::GetCamera();	// camera を持ってくる

		if (pCamera->GetCameraTarget() == CCamera::CAMERA_TARGET_TYPE::PLAYER)
		{
			pCamera->SetTargetPos(m_pCar->GetPos());	// camera に playerpos を入れる
		}

		m_pController->Update(m_pCar);
	}
}

//===========================================================================================================
// 生成処理
//===========================================================================================================
CPlayerManager* CPlayerManager::Create()
{
	CPlayerManager* pPlayerManager = new CPlayerManager;

	pPlayerManager->Init();

	return pPlayerManager;
}

