#pragma once
//===========================================================================================================================================================
// 
// player_controller.cppのヘッダー [player_controller.h]
// Author : souma umeda
// 
//===========================================================================================================================================================
#ifndef _PLAYER_CONTROLLER_H_
#define _PLAYER_CONTROLLER_H_
#include "main.h"
#include "car_player.h"

//===========================================================================================================
// プレイヤーコントローラークラス
//===========================================================================================================
class CPlayerController
{
public:
	CPlayerController();
	~CPlayerController();
	void Update(CCarPlayer*pCar);
private:

};




#endif // !PLAYER_CONTROLLER_H_
